# распознавание символов
import numpy as np


# тело нейрона
def f(x, w):
    s = b + np.sum(x @ w)
    return sigm(s)


# эпоха обучения
def train(w, D, Y):
    _w = w.copy()
    for x, y in zip(D, Y):
        w += a * (y - f(x, w)) * x
    return (w != _w).any()


# отладочная печать массива в строку
def array2str(array, height, width):
    string = ""
    for y in range(height):
        if y:
            string += "\n"
        for x in range(width):
            string += str(int(array[width * y + x])) + " "
    return string


# вырезание символа
def cut_D(D, shift, height, width):
    count = 0
    DD = np.zeros(height * width)
    for j in range(height):
        # print(count,(count + width))
        # print((D[j][shift:(shift + width)]))
        DD[count:count + width] = D[j][shift:shift + width]
        count += width
    return DD


HEIGHT = 12  # количество строк в символе
WIDTH = 7    # количество столбцов в символе

# исходные данные
D = np.array([
    [0, 1, 1, 1, 1, 1, 0,
     1, 1, 1, 1, 1, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     0, 0, 0, 0, 0, 1, 1,
     0, 0, 0, 0, 0, 1, 1,
     0, 0, 0, 0, 1, 1, 0,
     0, 0, 0, 1, 1, 0, 0,
     0, 0, 1, 1, 0, 0, 0,
     0, 1, 1, 0, 0, 0, 0,
     1, 1, 0, 0, 0, 0, 0,
     1, 1, 1, 1, 1, 1, 1,
     1, 1, 1, 1, 1, 1, 1],

    [1, 1, 1, 1, 1, 1, 1,
     1, 1, 1, 1, 1, 1, 1,
     0, 0, 0, 0, 0, 1, 1,
     0, 0, 0, 0, 0, 1, 1,
     0, 0, 0, 0, 1, 1, 0,
     0, 0, 1, 1, 1, 0, 0,
     0, 0, 1, 1, 1, 0, 0,
     0, 0, 0, 0, 1, 1, 0,
     0, 0, 0, 0, 0, 1, 1,
     0, 0, 0, 0, 0, 1, 1,
     1, 1, 1, 1, 1, 1, 1,
     1, 1, 1, 1, 1, 1, 1],

    [0, 1, 1, 1, 1, 1, 0,
     1, 1, 1, 1, 1, 1, 1,
     1, 1, 0, 0, 0, 0, 0,
     1, 1, 0, 0, 0, 0, 0,
     1, 1, 0, 0, 0, 0, 0,
     1, 1, 1, 1, 1, 1, 0,
     1, 1, 1, 1, 1, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 1, 1, 1, 1, 1,
     0, 1, 1, 1, 1, 1, 0],

    [0, 1, 1, 1, 1, 1, 0,
     1, 1, 1, 1, 1, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 0, 0, 0, 1, 1,
     1, 1, 1, 1, 1, 1, 1,
     0, 1, 1, 1, 1, 1, 0],
])

# выходной вектор
Y2 = np.array([1, 0, 0, 0])
Y3 = np.array([0, 1, 0, 0])
Y6 = np.array([0, 0, 1, 0])
Y0 = np.array([0, 0, 0, 1])

w2 = np.zeros((HEIGHT * WIDTH))  # инициализация весов
w3 = np.zeros((HEIGHT * WIDTH))  # инициализация весов
w6 = np.zeros((HEIGHT * WIDTH))  # инициализация весов
w0 = np.zeros((HEIGHT * WIDTH))  # инициализация весов
# исходные данные
print(w2, w2.size)
print(D.shape)

a = 0.1   # темп  обучения
b = -0.4  # торможение (смещение)

# активационная функция
sigm = lambda x: 1 if x > 0 else 0

# обучение и тестирование
while train(w2, D, Y2):
    print(w2)
while train(w3, D, Y3):
    print(w3)
while train(w6, D, Y6):
    print(w6)
while train(w0, D, Y0):
    print(w0)

for x in D:
    print(array2str(x, HEIGHT, WIDTH), "\n", f(x, w2), f(x, w3), f(x, w6), f(x, w0))

# # Нарисуем знак
D_test = np.array([
    [[1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1]],
    [[1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1]],
    [[1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1]]
])

# shift = 2
# print(cut_D(D_test[0,:,:],shift,height,width))

D_test_shape = (D_test.shape)
print(D_test_shape[2])

print("i2=", "i3=", "i6=", "i0=")
for j in range(3):
    print("__________Рисунок №", j + 1, "_________________")
    i0 = 0
    i2 = 0
    i3 = 0
    i6 = 0
    for shift in range(len(D_test[j, 0]) - WIDTH + 1):
        # print("shift", shift)
        D0 = cut_D(D_test[j], shift, HEIGHT, WIDTH)
        # print(array2str(D0, HEIGHT, WIDTH))
        if f(D0, w2) == 1:
            # print("есть символ 2")
            i2 += 1
        if f(D0, w3) == 1:
            # print("есть символ 3")
            i3 += 1
        if f(D0, w6) == 1:
            # print("есть символ 6")
            i6 += 1
        if f(D0, w0) == 1:
            # print("есть символ 0")
            i0 += 1
    # print ('i2=',i2, 'i3=', i3, 'i6=', i6, 'i0=', i0)
    print(i2, i3, i6, i0)
    if (i2 > i3) and (i2 > i6) and (i0 != 0):
        print('ограничение скорости (20)')
    if (i3 > i2) and (i3 > i6) and (i0 != 0):
        print('ограничение скорости (30)')
    if (i6 > i2) and (i6 > i3) and (i0 != 0):
        print('ограничение скорости (60)')
