

# работа с изображениями
import numpy as np
import matplotlib.pyplot as plt

# # чтение файла изображения
# img = plt.imread('tilimili.jpg')
# plt.imshow(img)
# plt.show()



# cохранение изображения
# plt.imshow(img)
# plt.imsave(fname='img.png',arr=img)

# четные и нечентные цифры
# распознавание образов
import numpy as np
w = np.zeros((3,3)) # инициализация весов
print(w)


# # исходные данные
# D = np.array([
#     [0,0,0],
#     [0,0,1],
#     [0,1,0],
#     [1,0,0],
#     [0,1,1]
# ]) 
# # выходной вектор
# Y0 = np.array([0,1,0,0,1])

# a = 0.2 # темп  обучения
# b = -0.4 # торможение (смещение)

# # активационная функция
# sigm = lambda x: 1 if x > 0 else 0

# # тело нейрона
# def f(x):
#     s = b + np.sum(x @ w)
#     return sigm(s)

# # эпоха обучения
# def train():
#     global w
#     _w = w.copy()
#     for x, y in zip(D, Y0):
#         w += a * (y - f(x)) * x
#     return (w != _w).any()  

# # обучение и тестирование
# while train():
#     print(w) 

# print(f([1,0,0]))
# print(f([1,0,1]))
# print(f([1,0,0.2]))

# # Me = np.eye(8)
# # print(Me)

# for x in D:
#     print(x, f(x))

# D_60 = np.array([
#     [0,	0,	0,	1,	1,	1,	1,	1,	0,	0,	0,	0,	1,	1,	1,	1,	1,	0,	0,	0,
#      0,	0,	1,	1,	1,	1,	1,	1,	1,	0,	0,	1,	1,	1,	1,	1,	1,	1,	0,	0,
#      0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	0,	0,	0,	0,	0,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	0,	0,	0,	0,	0,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	1,	1,	1,	1,	0,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	1,	1,	1,	1,	1,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,	1,	1,	0,	0,	0,	1,	1,	0,	0,
#      0,	0,	1,	1,	1,	1,	1,	1,	1,	0,	0,	1,	1,	1,	1,	1,	1,	1,	0,	0,
#      0,	0,	0,	1,	1,	1,	1,	1,	0,	0,	0,	0,	1,	1,	1,	1,	1,	0,	0,	0]
# ])

# N_60 = D_60.shape
